In [1]:
import pandas as pd
import os
from sqlalchemy import create_engine
import time
import datetime

In [2]:
thor_data = 'Resources/THOR_WWII_DATA_CLEAN.csv'

In [3]:
thor_df = pd.read_csv(thor_data, encoding='latin-1')
thor_df

,id,date,theater,naf,country_flying_mission,tgt_country,tgt_city,latitude,longitude
0,45601,9/3/39,ETO,RAF,GREAT BRITAIN,GERMANY,"""HAMBURG, BREMEN, RUHR""",53.563056,9.967222
1,45602,9/4/39,ETO,RAF,GREAT BRITAIN,GERMANY,WILHELMSHAVEN,53.500000,8.050000
2,45603,9/4/39,ETO,RAF,GREAT BRITAIN,GERMANY,BRUNSBUTTEL,53.895040,9.104836
3,45604,9/4/39,ETO,RAF,GREAT BRITAIN,GERMANY,RUHR,52.366667,9.716667
4,45605,9/5/39,ETO,RAF,GREAT BRITAIN,GERMANY,"""MAINZ, DARMSTADT, MANNHEIM, FRANKFURT""",48.766667,9.150000
...,...,...,...,...,...,...,...,...,...
178276,138346,12/31/45,PTO,7 AF,USA,BORNEO,BALIK PAPAN,-1.250000,116.833333
178277,138347,12/31/45,PTO,7 AF,USA,BORNEO,BALIK PAPAN,-1.250000,116.833333
178278,138348,12/31/45,PTO,7 AF,USA,BORNEO,BALIK PAPAN,-1.250000,116.833333
178279,138369,12/31/45,PTO,7 AF,USA,BORNEO,BALIK PAPAN,-1.250000,116.833333
178280,138377,12/31/45,PTO,7 AF,USA,BORNEO,BALIK PAPAN,-1.250000,116.833333

In [4]:
thor_df = thor_df[['date', 'theater','naf','country_flying_mission','tgt_country','tgt_city','latitude','longitude']].copy()
thor_df
thor_df = thor_df.sort_values(by='date').copy()

In [5]:
thor_df = thor_df.dropna(how='any').copy()
thor_df = thor_df.rename_axis('id').copy()
thor_df

,date,theater,naf,country_flying_mission,tgt_country,tgt_city,latitude,longitude
id,,,,,,,,
6799,1/1/41,ETO,RAF,GREAT BRITAIN,GERMANY,BREMEN,53.08,8.72
6809,1/1/41,ETO,RAF,GREAT BRITAIN,GERMANY,BREMEN,53.08,8.72
6810,1/1/41,ETO,RAF,GREAT BRITAIN,GERMANY,BREMEN,53.08,8.72
6811,1/1/41,ETO,RAF,GREAT BRITAIN,GERMANY,BREMEN,53.08,8.72
6812,1/1/41,ETO,RAF,GREAT BRITAIN,GERMANY,BREMEN,53.08,8.72
...,...,...,...,...,...,...,...,...
99267,9/9/44,ETO,RAF,GREAT BRITAIN,GERMANY,EMDEN,53.38,7.22
99250,9/9/44,ETO,RAF,GREAT BRITAIN,GREAT BRITAIN,MUNCHEN GLADBACH,51.20,6.42
99251,9/9/44,ETO,RAF,GREAT BRITAIN,GERMANY,MUNCHEN GLADBACH,51.20,6.42
99252,9/9/44,ETO,RAF,GREAT BRITAIN,GERMANY,MUNCHEN GLADBACH,51.20,6.42
99253,9/9/44,ETO,RAF,GREAT BRITAIN,GERMANY,MUNCHEN GLADBACH,51.20,6.42

In [6]:
# inserting df into db table
engine = create_engine('sqlite:///wwii.db', echo=False)
thor_df.to_sql('bombings', con=engine,if_exists='append')